# challenge one

In [1]:
import pandas as pd 
from operator import attrgetter

In [2]:
data = pd.read_excel('f:/sql interveiw/Halloween Costumes.xlsx')

In [3]:
df = data.copy(deep=True)

In [4]:
df.head()

,Costume,Country,Date,Sales at Full Price,Sales at Half Price,Sales at Quarter Price
0,Cat,Australia,01/10/2019,A$ 46660.55,NaN,NaN
1,Cat,Australia,01/10/2020,A$ 47476.21,NaN,NaN
2,Cat,Australia,01/11/2018,NaN,A$ 2076.00,NaN
3,Cat,Australia,01/11/2019,NaN,A$ 5964.00,NaN
4,Cat,Australia,02/10/2019,A$ 55920.69,NaN,NaN

In [5]:
df['Date'] = pd.to_datetime(df['Date'] , dayfirst=True)

In [6]:
df.Costume.unique()

array(['Cat', 'Chat', 'Clown', 'Devil', 'Diabel', 'Diable', 'Diabo',
       'Diavol', 'Diavolo', 'Dinosaur', 'Dinosaure', 'Dinosaurier',
       'Dinosauro', 'Dinosaurus', 'Dinozaur', 'Djevel', 'Gato', 'Geescht',
       'Geest', 'Geist', 'Ghost', 'Kat', 'Katt', 'Katze', 'Klaun',
       'Kloun', 'Klovn', 'Piraat', 'Pirat', 'Pirata', 'Pirate', 'Vampier',
       'Vampiir', 'Vampir', 'Vampire', 'Vampiro', 'Vampyr', 'Weerwolf',
       'Werewolf', 'Werwolf', 'Zambi', 'Zombi', 'Zombie', 'Zumbi'],
      dtype=object)

In [7]:
df.columns[3:]

Index(['Sales at Full Price', 'Sales at Half Price', 'Sales at Quarter Price'], dtype='object')

In [8]:
df.rename(columns={'Sales at Full Price':'Full Price','Sales at Half Price':'Half Price',
           'Sales at Quarter Price':'Quarter Price'} , inplace=True)

In [9]:
id = df.columns[:3]
value = df.columns[3:]

In [10]:
df2 = df.melt(id_vars=id,value_vars=value,var_name='price',value_name='sales')

In [11]:
df2.head()

  Costume    Country       Date       price        sales
0     Cat  Australia 2019-10-01  Full Price  A$ 46660.55
1     Cat  Australia 2020-10-01  Full Price  A$ 47476.21
2     Cat  Australia 2018-11-01  Full Price          NaN
3     Cat  Australia 2019-11-01  Full Price          NaN
4     Cat  Australia 2019-10-02  Full Price  A$ 55920.69

In [12]:
df2[['curruncy','sale']] = df2['sales'].str.split(pat=" ",n=1,expand=True)

In [13]:
df2.head()

  Costume    Country       Date       price        sales curruncy      sale
0     Cat  Australia 2019-10-01  Full Price  A$ 46660.55       A$  46660.55
1     Cat  Australia 2020-10-01  Full Price  A$ 47476.21       A$  47476.21
2     Cat  Australia 2018-11-01  Full Price          NaN      NaN       NaN
3     Cat  Australia 2019-11-01  Full Price          NaN      NaN       NaN
4     Cat  Australia 2019-10-02  Full Price  A$ 55920.69       A$  55920.69

In [14]:
df2['Date'].dt.month.value_counts()

10    13629
11     9702
Name: Date, dtype: int64

In [15]:
df2['period'] = df2['Date'].dt.to_period('M')

In [16]:
df2.head()

,Costume,Country,Date,price,sales,curruncy,sale,period
0,Cat,Australia,2019-10-01,Full Price,A$ 46660.55,A$,46660.55,2019-10
1,Cat,Australia,2020-10-01,Full Price,A$ 47476.21,A$,47476.21,2020-10
2,Cat,Australia,2018-11-01,Full Price,NaN,NaN,NaN,2018-11
3,Cat,Australia,2019-11-01,Full Price,NaN,NaN,NaN,2019-11
4,Cat,Australia,2019-10-02,Full Price,A$ 55920.69,A$,55920.69,2019-10

In [17]:
df2.drop(columns='Date' , inplace=True)

In [18]:
df2.head()

  Costume    Country       price        sales curruncy      sale   period
0     Cat  Australia  Full Price  A$ 46660.55       A$  46660.55  2019-10
1     Cat  Australia  Full Price  A$ 47476.21       A$  47476.21  2020-10
2     Cat  Australia  Full Price          NaN      NaN       NaN  2018-11
3     Cat  Australia  Full Price          NaN      NaN       NaN  2019-11
4     Cat  Australia  Full Price  A$ 55920.69       A$  55920.69  2019-10

In [19]:
ind = df2['period'].value_counts().index
ind

PeriodIndex(['2019-10', '2020-10', '2018-11', '2019-11', '2018-10'], dtype='period[M]')

In [20]:
pd.PeriodIndex(['2019-10','2018-11','2018-10'],dtype='period[M]')

PeriodIndex(['2019-10', '2018-11', '2018-10'], dtype='period[M]')

In [21]:
period_2019 = pd.PeriodIndex(['2019-10','2018-11','2018-10'],dtype='period[M]')
period_2020 =pd.PeriodIndex(['2020-10' ,'2019-11'],dtype='period[M]')

In [22]:
import numpy as np

In [23]:
def split(c):
    if c in  period_2019:
        return 2019
    if c in period_2020:
        return 2020
    else:
        return np.nan

In [24]:
df2['year'] = df2['period'].apply(lambda x : split(x))

In [25]:
df2.period.dtype

period[M]

In [26]:
df2.index = [df2.index,df2.year]

In [27]:
year_data = df2.sale.unstack()

In [28]:
year_data.columns = ['2019','2020']

In [29]:
year_data.columns

Index(['2019', '2020'], dtype='object')

In [30]:
year_data.shape

(23331, 2)

In [31]:
df2.index

MultiIndex([(    0, 2019),
            (    1, 2020),
            (    2, 2019),
            (    3, 2020),
            (    4, 2019),
            (    5, 2020),
            (    6, 2019),
            (    7, 2020),
            (    8, 2019),
            (    9, 2020),
            ...
            (23321, 2020),
            (23322, 2019),
            (23323, 2020),
            (23324, 2019),
            (23325, 2020),
            (23326, 2019),
            (23327, 2019),
            (23328, 2019),
            (23329, 2019),
            (23330, 2019)],
           names=[None, 'year'], length=23331)

In [32]:
year_data['2019']

0        46660.55
1             NaN
2             NaN
3             NaN
4        55920.69
           ...
23326         NaN
23327         NaN
23328         NaN
23329         NaN
23330         NaN
Name: 2019, Length: 23331, dtype: object

In [42]:
df2.reset_index(inplace= True)

In [79]:
df2['sales_19'] = year_data['2019'] 
df2['sales_2020'] = year_data['2020']

In [80]:
df2.head()

  Costume    Country       price        sales curruncy  sales_19 sales_2020
0     Cat  Australia  Full Price  A$ 46660.55       A$  46660.55        NaN
1     Cat  Australia  Full Price  A$ 47476.21       A$       NaN   47476.21
2     Cat  Australia  Full Price          NaN      NaN       NaN        NaN
3     Cat  Australia  Full Price          NaN      NaN       NaN        NaN
4     Cat  Australia  Full Price  A$ 55920.69       A$  55920.69        NaN

In [82]:
#df2.drop(columns=['year','sale','year','level_0'] , inplace= True)

In [83]:
df2.head()

  Costume    Country       price        sales curruncy  sales_19 sales_2020
0     Cat  Australia  Full Price  A$ 46660.55       A$  46660.55        NaN
1     Cat  Australia  Full Price  A$ 47476.21       A$       NaN   47476.21
2     Cat  Australia  Full Price          NaN      NaN       NaN        NaN
3     Cat  Australia  Full Price          NaN      NaN       NaN        NaN
4     Cat  Australia  Full Price  A$ 55920.69       A$  55920.69        NaN

In [84]:
f = df2

In [85]:
f.head()

  Costume    Country       price        sales curruncy  sales_19 sales_2020
0     Cat  Australia  Full Price  A$ 46660.55       A$  46660.55        NaN
1     Cat  Australia  Full Price  A$ 47476.21       A$       NaN   47476.21
2     Cat  Australia  Full Price          NaN      NaN       NaN        NaN
3     Cat  Australia  Full Price          NaN      NaN       NaN        NaN
4     Cat  Australia  Full Price  A$ 55920.69       A$  55920.69        NaN

In [62]:
df2.sales.unique()

array(['A$ 46660.55', 'A$ 47476.21', nan, ..., '€ 69.00', '€ 549.00',
       '€ 597.00'], dtype=object)

In [104]:
f.sales_19.astype(object)

0        46660.55
1             NaN
2             NaN
3             NaN
4        55920.69
           ...
23326         NaN
23327         NaN
23328         NaN
23329         NaN
23330         NaN
Name: sales_19, Length: 23331, dtype: object

In [105]:
'Leu 159313.87'.split()[1]

'159313.87'

In [121]:
def delet_leu(x):
    if  'leu' in x :
        return x.split()[1]
    elif x == ' NaN':
        return np.nan

In [140]:
def st(x):
    if isinstance(x,str):
        return(x.replace('Leu',''))
    return(x)

In [146]:
f['sales_19'] = f['sales_19'].apply(st).astype(float)
f['sales_2020'] = f['sales_2020'].apply(st).astype(float)

In [147]:
f['sales_19']

0        46660.55
1             NaN
2             NaN
3             NaN
4        55920.69
           ...
23326         NaN
23327         NaN
23328         NaN
23329         NaN
23330         NaN
Name: sales_19, Length: 23331, dtype: float64

In [148]:
f.groupby(['Costume','Country','price']).agg({'sales_19' : "sum",'sales_2020' :'sum'})

                                   sales_19  sales_2020
Costume Country   price
Cat     Australia Full Price     1502733.60  1297787.03
                  Half Price       38856.00    27984.00
                  Quarter Price    10134.00    10290.00
        Ireland   Full Price      752510.70   729024.78
                  Half Price       15528.50     6363.50
...                                     ...         ...
Zombie  US        Half Price       19840.00    12208.00
                  Quarter Price     6480.00     6772.00
Zumbi   Portugal  Full Price      759458.59   701510.92
                  Half Price       15678.00    11436.00
                  Quarter Price     5415.00     5442.00

[231 rows x 2 columns]

In [149]:
final = f.groupby(['Costume','Country','price']).agg({'sales_19' : "sum",'sales_2020' :'sum'})

In [152]:
final.reset_index(inplace=True)

In [153]:
final.head()

  Costume    Country          price   sales_19  sales_2020
0     Cat  Australia     Full Price  1502733.6  1297787.03
1     Cat  Australia     Half Price    38856.0    27984.00
2     Cat  Australia  Quarter Price    10134.0    10290.00
3     Cat    Ireland     Full Price   752510.7   729024.78
4     Cat    Ireland     Half Price    15528.5     6363.50